tap "apple/apple"
tap "clintmod/formulas"
tap "dart-lang/dart"
tap "eranif/codelite"
tap "filosottile/musl-cross"
tap "gcenx/wine"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "he3-app/he3"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services", "https://gitee.com/imirror/homebrew-services.git"
tap "jandedobbeleer/oh-my-posh"
tap "jeffreywildman/virt-manager"
tap "jimbojsb/launchrocket"
tap "koekeishiya/formulae"
tap "lihaoyun6/tap"
tap "louisbrunner/valgrind"
tap "messense/macos-cross-toolchains"
tap "minacle/chntpw"
tap "sidneys/homebrew"
tap "sunnyyoung/repo"
tap "teamookla/speedtest"
tap "timothyye/tap"
tap "wader/tap"
tap "zackelia/formulae"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# TIFF library and utilities
brew "libtiff"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Download with resuming and segmented downloading
brew "aria2"
# FSF/GNU binutils for cross-compiling to arm-linux
brew "arm-linux-gnueabihf-binutils"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell extension to jump to frequently used directories
brew "autojump"
# Light UNIX download accelerator
brew "axel"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Development kit for the Java programming language
brew "openjdk@11"
# Google's own build tool
brew "bazel", link: false
# User-friendly launcher for Bazel
brew "bazelisk"
# Parser generator
brew "bison"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Format bazel BUILD files with a standard convention
brew "buildifier"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Object-file caching compiler wrapper
brew "ccache"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Mozilla CA bundle for Python
brew "certifi"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Ruby environment tool
brew "chruby"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Library and tools for advanced file I/O with HTTP-based protocols
brew "davix"
# Generate documentation for several programming languages
brew "doxygen"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Audio codec
brew "opus"
# VP8/VP9 video codec
brew "libvpx"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Process Management Interface for HPC environments
brew "pmix"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Platform built on V8 to build network applications
brew "node"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# Network related modules for glib
brew "glib-networking"
# C++ mathematics library for graphics software
brew "glm"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Common error values for all GnuPG components
brew "libgpg-error"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Development framework for multimedia applications
brew "gstreamer"
# Fast, simple & powerful blog framework
brew "hexo"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Manage your Java environment
brew "jenv"
# Environment diagnostics for Kotlin Multiplatform Mobile app development
brew "kdoctor"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Lets you manipulate the signature block in a Mach-O binary
brew "ldid"
# Portable Foreign Function Interface library
brew "libffi"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.6"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# C virtualization API
brew "libvirt"
# Libvirt virtualization API python binding
brew "libvirt-python"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Next-gen compiler infrastructure
brew "llvm"
# Next-gen compiler infrastructure
brew "llvm@16"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# General-purpose lossless data-compression library
brew "zlib"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@20"
# Command-line Git information tool
brew "onefetch"
# Perl compatible regular expressions library
brew "pcre"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf", link: false
# Tool for managing OCI containers and pods
brew "podman"
# Service monitoring system and time series database
brew "prometheus"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Static site generator for Swift developers
brew "publish"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# State machine compiler
brew "ragel"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# High performance, scalable, fault-tolerant access to data
brew "xrootd"
# Object oriented framework for large scale data analysis
brew "root"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# Display and control your Android device
brew "scrcpy"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# SDL 1.2 compatibility layer that uses SDL 2.0 behind the scenes
brew "sdl12-compat"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# GNU's portable shell tool
brew "shtool"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftgen"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Convert TeXinfo files to HTML
brew "texi2html"
# Official documentation format of the GNU project
brew "texinfo"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Fast Xcode unarchiver
brew "unxip"
# Google's JavaScript engine
brew "v8"
# Terminal emulator widget used by GNOME terminal
brew "vte3"
# App for managing virtual machines
brew "virt-manager"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Cross-platform build utility based on Lua
brew "xmake", args: ["HEAD"]
# JavaScript package manager
brew "yarn"
# Modular BSD reimplementation of NASM
brew "yasm"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi", args: ["HEAD"]
# Dumb downloader that scrapes the web
brew "you-get"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Backup and Restore your Mac System and App Preferences
brew "clintmod/formulas/macprefs"
# SDK
brew "dart-lang/dart/dart", link: false
# Linux cross compilers based on musl libc
brew "filosottile/musl-cross/musl-cross"
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac"
# Packer
brew "hashicorp/tap/packer"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# App for virtualized guest interaction
brew "jeffreywildman/virt-manager/virt-viewer"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# aarch64 Linux GNU Toolchain
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-gnu"
# x86_64 Linux GNU Toolchain
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
# The Offline NT Password Editor
brew "minacle/chntpw/chntpw"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# A simple and powerful SSH Keys Manager
brew "timothyye/tap/skm"
# jq for binary formats
brew "wader/tap/fq"
# macOS command-line utility to limit max battery charge
brew "zackelia/formulae/bclm"
# Get the battery level of all your devices on your Mac.
cask "airbattery"
# Enable Windows-like alt-tab
cask "alt-tab"
# iOS App Store alternative
cask "altserver", args: { appdir: "/Applications/Applite" }
# Android SDK component
cask "android-platform-tools"
# User-friendly GUI app for Homebrew
cask "applite"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher", args: { appdir: "/Applications/Applite" }
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Online gaming platform
cask "battle-net", args: { appdir: "/Applications/Applite" }
# IDE for C, C++, Rust, Python, PHP and Node.js
cask "codelite-official"
# Voice and text chat software
cask "discord", args: { appdir: "/Applications/Applite" }
# Status monitoring
cask "eul", args: { appdir: "/Applications/Applite" }
# Collaborative team software
cask "figma", args: { appdir: "/Applications/Applite" }
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-wenkai"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
# Game development engine
cask "godot", args: { appdir: "/Applications/Applite" }
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Switch input method per application
cask "keyboardholder"
# Open-source keystroke visualiser
cask "keycastr"
# Preference pane to manage Homebrew-installed services
cask "launchrocket"
# File system integration
cask "macfuse"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Open-source software for live streaming and screen recording
cask "obs", args: { appdir: "/Applications/Applite" }
# Alternate version of the Opera web browser to complement gaming
cask "opera-gx", args: { appdir: "/Applications/Applite" }
# Replacement for Docker Desktop
cask "orbstack"
# Tool for uploading images
cask "picgo"
# Collaboration platform for API development
cask "postman", args: { appdir: "/Applications/Applite" }
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Screenshot measurement and annotation tool
cask "shottr"
# Quicklook extension for source files
cask "syntax-highlight"
# Desktop client for Telegram messenger
cask "telegram-desktop", args: { appdir: "/Applications/Applite" }
# Web browser focusing on security
cask "tor-browser", args: { appdir: "/Applications/Applite" }
# Virtual machines UI using QEMU
cask "utm"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium", args: { appdir: "/Applications/Applite" }
# Rust-based terminal
cask "warp", args: { appdir: "/Applications/Applite" }
# Terminal emulator
cask "wave"
# Free messaging and calling application
cask "wechat", args: { appdir: "/Applications/Applite" }
# A command line utility to work with WeChatTweak-macOS.
cask "wechattweak-cli"
# Compatibility layer to run Windows applications
cask "wine-crossover"
# Porting tool, to make Windows programs/games into native apps
cask "wineskin"
# Third-party NetEase cloud player
cask "yesplaymusic"
vscode "1yib.rust-bundle"
vscode "2211896472.snippets"
vscode "aaron-bond.better-comments"
vscode "acharluk.easy-cpp-projects"
vscode "adpyke.codesnap"
vscode "adriano-markovic.c-cpp-makefile-project"
vscode "ajshort.include-autocomplete"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "akamud.vscode-theme-onedark"
vscode "albinbd.run"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexisvt.flutter-snippets"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "aminer.codegeex"
vscode "amiralizadeh9480.cpp-helper"
vscode "andenetalexander.vim-cheatsheet"
vscode "andyyaldoo.vscode-json"
vscode "asheor.c-cpp-run-anywhere"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "baiducomate.comate"
vscode "batisteo.vscode-django"
vscode "bazelbuild.vscode-bazel"
vscode "bbenoist.togglehs"
vscode "be5invis.vscode-custom-css"
vscode "beardedbear.beardedtheme"
vscode "benjamin-simmonds.pythoncpp-debug"
vscode "benjaminblonde.monokai-alt"
vscode "bierner.lit-html"
vscode "bierner.markdown-checkbox"
vscode "bito.bito"
vscode "bmalehorn.shell-syntax"
vscode "britesnow.vscode-toggle-quotes"
vscode "ccagml.vscode-leetcode-problem-rating"
vscode "chenperach.c-cpp-cmake-project-creator"
vscode "cheshirekow.cmake-format"
vscode "chouzz.vscode-better-align"
vscode "chris-noring.cpp-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "clinyong.vscode-css-modules"
vscode "code-nature.nilesoft-shell-file-formatter"
vscode "codeinchinese.englishchinesedictionary"
vscode "codeium.codeium"
vscode "codesnippetsai.codesnippetsai"
vscode "codezombiech.gitignore"
vscode "codium.codium"
vscode "cschlosser.doxdocgen"
vscode "cweijan.vscode-office"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "danielpinto8zz6.c-cpp-project-generator"
vscode "danielsanmedium.dscodegpt"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "davidwoo.flutter-auto-import"
vscode "dbaeumer.vscode-eslint"
vscode "dcasella.monokai-plusplus"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "doublebuffer.metal-shader"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "dtoplak.vscode-glsllint"
vscode "dunstontc.viml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-community-material-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "fittentech.fitten-code"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.terminal"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "franneck94.vscode-c-cpp-config"
vscode "frenco.vscode-notion"
vscode "geforcelegend.vscode-glsl"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "gmlewis-vscode.flutter-stylizer"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "gornivv.vscode-flutter-files"
vscode "gruntfuggly.todo-tree"
vscode "guodongsun.vscode-git-cruise"
vscode "harryhopkinson.vim-theme"
vscode "hars.cppsnippets"
vscode "hatzelencio.exec-cmd"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "hookyqr.beautify"
vscode "howardzuo.vscode-npm-dependency"
vscode "ibm.output-colorizer"
vscode "idered.npm"
vscode "infeng.vscode-react-typescript"
vscode "jackiotyu.quick-reference"
vscode "james-yu.latex-workshop"
vscode "jamesmaj.easy-icons"
vscode "jasmaa.vscode-sil"
vscode "jasonnutter.search-node-modules"
vscode "jaycetyle.vscode-gnu-global"
vscode "jebbs.markdown-extended"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeremyrajan.react-component"
vscode "jetmartin.bats"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "jonsmithers.open-in-vim"
vscode "josefpihrt-vscode.snippetica-cpp"
vscode "josetr.cmake-language-support-vscode"
vscode "jundat95.react-native-snippet"
vscode "k--kato.intellij-idea-keybindings"
vscode "kamikillerto.vscode-colorize"
vscode "kasik96.swift"
vscode "kevinkyang.auto-comment-blocks"
vscode "kevinmcgowan.typescriptimport"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kortina.run-in-terminal"
vscode "ktiays.aicursor"
vscode "labuladong.leetcode-helper"
vscode "leetcode.vscode-leetcode"
vscode "leizongmin.node-module-intellisense"
vscode "leojhonsong.ccpp-extension-pack"
vscode "letmaik.git-tree-compare"
vscode "liviuschera.noctis"
vscode "lkytal.flatui"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lmcarreiro.vscode-smart-column-indenter"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magicstack.magicpython"
vscode "mangeshrex.everblush"
vscode "marcelovelasquez.flutter-tree"
vscode "marscode.marscode-extension"
vscode "matepek.vscode-catch2-test-adapter"
vscode "mathiasfrohlich.kotlin"
vscode "mccarter.start-git-bash"
vscode "meteorstudio.cursorcode"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "mike-co.import-sorter"
vscode "mikeburgh.xml-format"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mitaki28.vscode-clang"
vscode "monish.regexsnippets"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrcrowl.hg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vs-keybindings"
vscode "msjsdiag.vscode-react-native"
vscode "muhammadsammy.flat-ui-dark"
vscode "mythmon.idl"
vscode "nash.awesome-flutter-snippets"
vscode "nathanridley.autotrim"
vscode "naumovs.color-highlight"
vscode "nicepkg.aide-pro"
vscode "niudai.remote-github"
vscode "njpwerner.autodocstring"
vscode "npclaudiu.vscode-gn"
vscode "nucllear.vscode-extension-auto-import"
vscode "obkoro1.korofileheader"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "oouo-diogo-perdigao.docthis"
vscode "ornithologist.ios-snippets"
vscode "parallelsdesktop.parallels-desktop"
vscode "philsinatra.nested-comments"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "plex.vscode-protolint"
vscode "pmneo.tsimporter"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "programmershri.cppsnippets"
vscode "psioniq.psi-header"
vscode "qcz.text-power-tools"
vscode "quicktype.quicktype"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "renkun.reader"
vscode "rid9.datetime"
vscode "ritwickdey.liveserver"
vscode "robertz.code-snapshot"
vscode "rodrigorahman.flutter-dart-utils"
vscode "rogalmic.bash-debug"
vscode "rokoroku.vscode-theme-darcula"
vscode "ronnysherer.cpp-assist"
vscode "royaction.color-manager"
vscode "russell.any-rule"
vscode "rust-lang.rust-analyzer"
vscode "safurai.safurai"
vscode "sainnhe.gruvbox-material"
vscode "sankethdev.vscode-proto"
vscode "satoren.lrdb"
vscode "serayuzgur.crates"
vscode "shakram02.bash-beautify"
vscode "shan.code-settings-sync"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "simonsiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.shader"
vscode "slevesque.vscode-hexdump"
vscode "sourcegraph.cody-ai"
vscode "spmeesseman.vscode-taskexplorer"
vscode "spywhere.guides"
vscode "sswg.swift-lang"
vscode "stackbuild.bazel-stack-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "strum355.vscode-mc-shader"
vscode "t7yang.hyper-javascript-snippets"
vscode "tabnine.tabnine-vscode"
vscode "tahabasri.snippets"
vscode "tal7aouy.theme"
vscode "tboox.xmake-vscode"
vscode "tibotix.definition-autocompletion"
vscode "tinkertrain.theme-panda"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "tomphilbin.gruvbox-themes"
vscode "tr4uma.swift-sfdc"
vscode "trabpukcip.vscode-npm-scripts"
vscode "twxs.cmake"
vscode "unbug.codelf"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vknabel.vscode-apple-swift-format"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wakatime.vscode-wakatime"
vscode "wangtao0101.debug-leetcode"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "wingrunr21.vscode-ruby"
vscode "wk-j.save-and-run"
vscode "wmaurer.change-case"
vscode "woodywoodsta.vscode-material-syntax-dark"
vscode "wowbox.code-debuger"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "xadillax.viml"
vscode "xaver.clang-format"
vscode "xaviercai.vscode-leetcode-cpp-debug"
vscode "xshrim.txt-syntax"
vscode "yao-translate.yao-translate"
vscode "yxl.cloudmusic"
vscode "yyxhx.cpp-quick-start-snippet-for-beginners"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"
vscode "zhang-renyang.vscode-react"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "zokugun.cron-tasks"
vscode "zokugun.sync-settings"
vscode "zxh404.vscode-proto3"
