tap "apple/apple"
tap "homebrew/bundle"
tap "homebrew/services", "https://mirrors.ustc.edu.cn/homebrew-services.git"
# Keep your Mac's application settings in sync
brew "mackup"
vscode "2211896472.snippets"
vscode "aaron-bond.better-comments"
vscode "ACharLuk.easy-cpp-projects"
vscode "adpyke.codesnap"
vscode "adriano-markovic.c-cpp-makefile-project"
vscode "ajshort.include-autocomplete"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "akamud.vscode-theme-onedark"
vscode "AlbinBD.run"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "alexisvt.flutter-snippets"
vscode "Alibaba-Cloud.tongyi-lingma"
vscode "AMiner.codegeex"
vscode "amiralizadeh9480.cpp-helper"
vscode "AndenetAlexander.vim-cheatsheet"
vscode "asheor.c-cpp-run-anywhere"
vscode "azemoh.one-monokai"
vscode "batisteo.vscode-django"
vscode "BazelBuild.vscode-bazel"
vscode "bbenoist.togglehs"
vscode "be5invis.vscode-custom-css"
vscode "BeardedBear.beardedtheme"
vscode "benjamin-simmonds.pythoncpp-debug"
vscode "benjaminBlonde.monokai-alt"
vscode "bierner.lit-html"
vscode "bierner.markdown-checkbox"
vscode "Bito.Bito"
vscode "BriteSnow.vscode-toggle-quotes"
vscode "ccagml.vscode-leetcode-problem-rating"
vscode "ChenPerach.c-cpp-cmake-project-creator"
vscode "cheshirekow.cmake-format"
vscode "chouzz.vscode-better-align"
vscode "chris-noring.cpp-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "clinyong.vscode-css-modules"
vscode "CodeInChinese.EnglishChineseDictionary"
vscode "Codeium.codeium"
vscode "codesnippetsai.codesnippetsai"
vscode "codezombiech.gitignore"
vscode "Codium.codium"
vscode "cschlosser.doxdocgen"
vscode "cweijan.vscode-office"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "danielpinto8zz6.c-cpp-project-generator"
vscode "DanielSanMedium.dscodegpt"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "davidwoo.flutter-auto-import"
vscode "dbaeumer.vscode-eslint"
vscode "dcasella.monokai-plusplus"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "DotJoshJohnson.xml"
vscode "doublebuffer.metal-shader"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "dtoplak.vscode-glsllint"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.terminal"
vscode "foxundermoon.shell-format"
vscode "franneck94.c-cpp-runner"
vscode "franneck94.vscode-c-cpp-config"
vscode "frenco.vscode-notion"
vscode "GeForceLegend.vscode-glsl"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "gornivv.vscode-flutter-files"
vscode "Gruntfuggly.todo-tree"
vscode "GuodongSun.vscode-git-cruise"
vscode "HarryHopkinson.vim-theme"
vscode "hars.CppSnippets"
vscode "hatzelencio.exec-cmd"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "HookyQR.beautify"
vscode "IBM.output-colorizer"
vscode "James-Yu.latex-workshop"
vscode "jamesmaj.easy-icons"
vscode "jasmaa.vscode-sil"
vscode "jasonnutter.search-node-modules"
vscode "jaycetyle.vscode-gnu-global"
vscode "jdinhlife.gruvbox"
vscode "jebbs.markdown-extended"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeremyrajan.react-component"
vscode "jetmartin.bats"
vscode "JonathanHarty.gruvbox-material-icon-theme"
vscode "jonsmithers.open-in-vim"
vscode "josefpihrt-vscode.snippetica-cpp"
vscode "josetr.cmake-language-support-vscode"
vscode "jundat95.react-native-snippet"
vscode "k--kato.intellij-idea-keybindings"
vscode "Kasik96.swift"
vscode "kevinkyang.auto-comment-blocks"
vscode "kevinmcgowan.TypeScriptImport"
vscode "KevinRose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kortina.run-in-terminal"
vscode "labuladong.leetcode-helper"
vscode "LeetCode.vscode-leetcode"
vscode "leizongmin.node-module-intellisense"
vscode "LeoJhonSong.ccpp-extension-pack"
vscode "liviuschera.noctis"
vscode "lkytal.FlatUI"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magicstack.MagicPython"
vscode "mangeshrex.Everblush"
vscode "marcelovelasquez.flutter-tree"
vscode "matepek.vscode-catch2-test-adapter"
vscode "mathiasfrohlich.Kotlin"
vscode "McCarter.start-git-bash"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mike-co.import-sorter"
vscode "mikeburgh.xml-format"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mitaki28.vscode-clang"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vs-keybindings"
vscode "msjsdiag.vscode-react-native"
vscode "muhammadsammy.flat-ui-dark"
vscode "naumovs.color-highlight"
vscode "niudai.remote-github"
vscode "njpwerner.autodocstring"
vscode "npclaudiu.vscode-gn"
vscode "NuclleaR.vscode-extension-auto-import"
vscode "OBKoro1.korofileheader"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "oouo-diogo-perdigao.docthis"
vscode "ornithologist.ios-snippets"
vscode "philsinatra.nested-comments"
vscode "PKief.material-icon-theme"
vscode "PKief.material-product-icons"
vscode "plex.vscode-protolint"
vscode "pmneo.tsimporter"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "ProgrammerShri.cppsnippets"
vscode "psioniq.psi-header"
vscode "qcz.text-power-tools"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "rebornix.ruby"
vscode "renkun.reader"
vscode "rid9.datetime"
vscode "ritwickdey.LiveServer"
vscode "rogalmic.bash-debug"
vscode "rokoroku.vscode-theme-darcula"
vscode "ronnysherer.cpp-assist"
vscode "royaction.color-manager"
vscode "russell.any-rule"
vscode "Safurai.Safurai"
vscode "sainnhe.gruvbox-material"
vscode "sankethdev.vscode-proto"
vscode "satoren.lrdb"
vscode "shakram02.bash-beautify"
vscode "Shan.code-settings-sync"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "Shopify.ruby-lsp"
vscode "SimonSiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.shader"
vscode "slevesque.vscode-hexdump"
vscode "spywhere.guides"
vscode "sswg.swift-lang"
vscode "StackBuild.bazel-stack-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "Strum355.vscode-mc-shader"
vscode "t7yang.hyper-javascript-snippets"
vscode "TabNine.tabnine-vscode"
vscode "tahabasri.snippets"
vscode "tal7aouy.theme"
vscode "tboox.xmake-vscode"
vscode "tibotix.definition-autocompletion"
vscode "tinkertrain.theme-panda"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "tomphilbin.gruvbox-themes"
vscode "twxs.cmake"
vscode "unbug.codelf"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "vknabel.vscode-apple-swift-format"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "waderyan.gitblame"
vscode "WakaTime.vscode-wakatime"
vscode "wangtao0101.debug-leetcode"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "wholroyd.jinja"
vscode "wingrunr21.vscode-ruby"
vscode "withfig.fig"
vscode "wk-j.save-and-run"
vscode "wmaurer.change-case"
vscode "woodywoodsta.vscode-material-syntax-dark"
vscode "wowbox.code-debuger"
vscode "xabikos.JavaScriptSnippets"
vscode "xabikos.ReactSnippets"
vscode "XadillaX.viml"
vscode "xaver.clang-format"
vscode "XavierCai.vscode-leetcode-cpp-debug"
vscode "xshrim.txt-syntax"
vscode "Yao-Translate.yao-translate"
vscode "YXL.cloudmusic"
vscode "yyxhx.cpp-quick-start-snippet-for-beginners"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
vscode "zxz-moe.zxz-moe-bis"
