jorgebucaran/fisher
jethrokuan/z
pure-fish/pure
jorgebucaran/nvm.fish
ilancosman/tide@v6
gazorby/fifc
patrickf1/fzf.fish
andreiborisov/sponge
jorgebucaran/autopair.fish
jhillyerd/plugin-git
franciscolourenco/done
jorgebucaran/replay.fish
rodrigobdz/fish-apple-touchbar
